#!/bin/sh
set -o errexit
set -o nounset


################################################################################################
## 关闭无用服务
################################################################################################
systemctl stop postfix.service && systemctl disable postfix.service

################################################################################################
## 设置 ls 输出时间格式
################################################################################################
i="export TIME_STYLE='+%Y-%m-%d %H:%M:%S'"
echo ${i} >> /etc/profile

################################################################################################
## 修改系统参数
################################################################################################
ulimit -u 1048576
ulimit -n 65535
cat <<\EOF >>/etc/security/limits.conf
* soft nofile 1048576
* hard nofile 1048576
* soft nproc 65535
* hard nproc 65535
EOF

sysctl -p

################################################################################################
## 修改history最大记录数
################################################################################################
sed -i 's/^HISTSIZE=1000/HISTSIZE=10000/' /etc/profile

################################################################################################
## 设置 history 命令记录详细时间戳
################################################################################################
isHISTTIMEFORMAT=`cat /etc/bashrc | grep HISTTIMEFORMAT | wc -l`
if [ ${isHISTTIMEFORMAT} -eq 0 ]
then
    echo 'HISTTIMEFORMAT="%Y-%m-%d:%H-%M-%S:`whoami`:"' >> /etc/bashrc
    echo 'export HISTTIMEFORMAT' >> /etc/bashrc
fi

################################################################################################
## 设置登录 shell 后主机名变色
################################################################################################
isPS1=`cat /etc/profile | grep 'PS1' | wc -l`
if [ ${isPS1} -eq 0 ]
then
    echo 等于0
    echo "PS1='[\[\e[0;33m\]\t \[\e[m\]\[\e[0;35m\]\[\e[0;36m\]\u\[\e[m\]\[\e[0;34m\]@\[\e[m\]\[\e[0;31m\]\h \w\[\e[m\] \$]'" >> /etc/profile
fi


################################################################################################
## 安装VIM编辑器并个性化配置
################################################################################################
# 安装vim编辑器
yum install -y vim

# 修改vimrc配置文件之前先备份
/bin/grep 666666 /etc/vimrc && /bin/cp /etc/vimrc.666666 /etc/vimrc || /bin/cp /etc/vimrc /etc/vimrc.666666
cat <<EOF >>/etc/vimrc
" add by 666666 QQ:1327133225
" 表示按一个tab之后，显示出来的相当于几个空格，默认的是8个。 
set tabstop=4
" 表示在编辑模式的时候按退格键的时候退回缩进的长度。 
set softtabstop=4
" 表示每一级缩进的长度，一般设置成跟 softtabstop 一样
set shiftwidth=4
" 当设置成 expandtab 时，缩进用空格来表示，noexpandtab 则是用制表符表示一个缩进。
" 个人习惯使用 ｀set expandtab｀ 
set expandtab
" 输入搜索内容时就显示搜索结果
set incsearch
" 搜索时忽略大小写
set ignorecase smartcase
" 显示行号
" set nu!
" 搜索时高亮显示被找到的文本
set hlsearch
" 代码补全
set completeopt=preview,menu
" 高亮显示匹配的括号
set showmatch
" 取消自动注释
set paste
EOF

################################################################################################
## 取消 VIM 的自动注释功能
################################################################################################
isPaste=`cat /etc/vimrc | grep 'set paste' | wc -l`
if [ ${isPaste} -eq 0 ]
then
    echo '" 取消自动注释' >> /etc/vimrc
    echo 'set paste' >> /etc/vimrc
fi

################################################################################################
## 执行成功
################################################################################################
echoCyan(){
    echo -e "\033[36m$*\033[0m"
}

echoCyan "Success"
